{"/about/":{"data":{"":"","mission#Mission":"To help companies and individuals, in overcoming the barriers posed by the foundational need of any software system,\nthat of keeping data safe. Standards and technologies decomposed in concepts, ideas, techniques, and mechanisms on the\nidentity and access management (IAM) space are the tools to achieve the goal.","services#Services":" Consulting Education Tech Talk Coaching Areas of Expertise Standards FIDO2 Open ID Connect OAuth2 NIST 800-56 (Key Establishment) NIST 800-63 (Digital Identity) KYC (Identity Verification) … Technical Domains Identity Management Authentication Authorization Session … Architecture High and Low Level Design Platforms Services Frameworks … For any inquires, please reach out to info@bitscrafter.com","social-media#Social Media":" x.com/bitscrafter youtube.com/@bitscrafter linkedin.com/company/bitscrafter ","what-is-bitscrafter#What is Bitscrafter?":"Bitscrafter is the place where topics to address this mission are introduced and discussed. As such, its intention is to spark the curiosity of the reader and/or viewer to initiate conversations on how to go about solving common IAM problems.\nWhat’s in the name? Similar to an artist, a software engineer is a craftsperson dealing with the intricacies of what is required to produce something worthwhile. The craftsperson must not only have the vision but also the knowledge and perseverance of working on the bits and pieces to make sense of the whole.","who-we-are#Who we are":"Luis Rios linkedin.com/in/jlrios\nSeasoned technologist with over 25 years of experience, having worn the hats of subject matter expert, software architect, software engineer, mentor, technical leader, entrepreneur, and product owner. Adept at creating innovative and high-quality solutions that stand the test of time. Sought-after authority in the identity and access management domain, including industry standards such as OAuth2, OpenID Connect, Key Establishment, and FIDO2 that permeate to areas such as security, key agreement, authentication, authorization, session management, data privacy, consent management, identity verification, as well as user and entity behavioral analytics. Professional Experience A short summary of past experience "},"title":"About"},"/blogs/":{"data":{"":"","topics#Topics":"Key Establishment End to End Secure Data Transmission An introduction to end to end encryption Trust Bootstrapping Trust Bootstrapping, a Security Pillar Establishing the trust of a digital relationship "},"title":"Blogs"},"/blogs/end_to_end_secure_data_transmission/":{"data":{"":"","conclusion#Conclusion":"Given the evolving nature of cyberattacks and increasing data privacy regulations, addressing end-to-end traffic protection is crucial for any digital service relying on data transmission. This article presented proven industry practices, concepts, and considerations for solving this common problem.\nThe key security properties that data in transit must have:\nAuthenticity. Tamper Proof (Integrity and Confidentiality). Non-Repudiation. Perfect Forward Secrecy. These security properties can be achieved by:\nEstablishing a Trust Relationship. Defining and Executing a Key Agreement Procedure. ","disclaimer#Disclaimer":"All content provided in this article is exclusively for informational purposes only. The source for the making of this content is information of public domain as detailed in the references.\nThe owner of this article makes no representations as to the accuracy or completeness of any information presented. The owner will not be liable for any errors or omissions in this information nor for its availability, as well as not liable for any losses or damages resulting from the use of this information.","introduction#Introduction":"Service providers and their technologies have been increasingly scrutinized by governments and the public due to the unfortunate consequences of their security practices—or lack thereof. One critical area to secure is commonly referred to as data-in-transit. Transmitting data over the internet, or any unsecured network, comes with inherent risks that can’t be ignored.\nUnauthorized access to transmitted data is possible through an attack known as a man-in-the-middle (MITM). As the name suggests, a malicious actor intercepts communication between two parties to gain some benefit. There are many ways these attacks can occur; however, for brevity, we’ll assume unauthorized data access is both feasible and highly probable.\nThe solution prevents anyone intercepting the communication from understanding or manipulating the intercepted messages, regardless of the type of MITM attack. This is achieved using well-known cryptographic techniques that guarantee the authenticity, integrity, and confidentiality of the transmitted messages.","making-progress#Making Progress":"Let’s break down a partial solution for the first property: preventing unauthorized parties from reading or modifying the message. Encryption can prevent unauthorized reading, while a signature or a digest can prevent tampering. However, these primitives require a secret. Using a pre-agreed long-lived secret works, but what if it gets compromised? Introducing ephemerality and randomness to the secret can address this concern.\nMessages thus must show an additional property:\nThey have perfect forward secrecy, meaning a compromised session key affects only the messages protected with that key and a compromised long-lived key doesn’t affect any previously protected messages. Using a key exchange primitive, the Sender and Receiver can generate a common value. The output of the key exchange should not be used as the secret itself but as input to a key derivation method that uses a pseudo-random function (PRF) to generate the actual secret that becomes the session key.\nTo tackle tampering and forward secrecy, a key agreement procedure using key exchange and PRF primitives is needed. Figure 2 illustrates this idea.\nFigure 2 While the transmitted message is guaranteed to be protected end to end strictly speaking, the Attacker might have intercepted the previous messages carrying the key agreement material and thus enabling the manipulation of the procedure in a way that goes unnoticed by the Sender and Receiver. In this scenario, the Attacker effectively becomes the Sender, the Receiver, and/or simply an intermediary that understands the communication and thus can act on it.\nThis attack is attainable because neither the Sender nor Receiver are authenticated as the absence of long-lived keys would suggest. Even if they each hold their ephemeral private key, the Attacker could neglect this by generating its own ephemeral key pair impersonating the participation of the Sender or Receiver or both.","references#References":" Elaine Barker (NIST), Lily Chen (NIST), Allen Roginsky (NIST), Apostol Vassilev (NIST), Richard Davis (NSA). NIST, “Recommendation for Pair-Wise Key-Establishment Schemes Using Discrete Logarithm Cryptography”, Revision 3, April 2018, csrc.nist.gov/pubs/sp/800/56/a/r3/final Elaine Barker (NIST), Lily Chen (NIST), Richard Davis (NSA). NIST, “Recommendation for Key-Derivation Methods in Key-Establishment Schemes”, Revision 2, August 2020, csrc.nist.gov/pubs/sp/800/56/c/r2/final Lily Chen (NIST). NIST, “Recommendation for Key Derivation Using Pseudorandom Functions”, Revision 1 Update 1, August 2022, csrc.nist.gov/pubs/sp/800/108/r1/upd1/final H. Krawczyk (IBM Research), P. Eronen (Nokia). IETF, “HMAC-based Extract-and-Expand Key Derivation Function (HKDF)”, May 2010, datatracker.ietf.org/doc/html/rfc5869 ","the-analysis#The Analysis":"To solve this problem, we need a mechanism by which both ends of the communication can assert that the messages show the following properties:\nThey can’t be tampered with, ensuring the original message is not read before it reaches the receiver unchanged. They are authentic, confirming the message was created by the sender and was intended for the receiver. They can’t be repudiated, meaning the participants can’t deny having sent or received them. They exhibit forward secrecy, ensuring the compromise of a secret does not compromise other message exchanges. ","the-problem#The Problem":"The scenario in this discussion centers securing the communication across the internet between two participants. The issue at hand is that someone other than the intended participants could access the message and benefit from this knowledge. Below, Figure 1 illustrates a simplification of this scenario.\nFigure 1 Attackers can inject themselves into three logical places: local networks and the internet. To define a sensible solution, we must assume no place is safe once the message leaves the application’s memory space. Vulnerabilities can exist in any underlying protocols and technologies used to transmit the message.","the-solution#The Solution":"Now, let’s address the authenticity aspect. Without authentication, the Sender and Receiver don’t know who they’re communicating with. They must establish a trust mechanism where participants verify each other’s identity before any interaction. This trust establishment involves exchanging:\nA public key. Proof of possession of the associated private key. Key agreement procedure parameters. Trust can be established directly (e.g., face-to-face interactions) or indirectly (e.g., through a trusted Certificate Authority). Figure 3 describes this solution.\nThe use of authenticity unveils a fourth desired property to messages flowing between the participants:\nOnce done, a participant cannot deny their participation in the message exchange. This is accomplished by participants demonstrating possession of a private key.\nFigure 3 Participants must set up long-lived secrets in secure places like Trusted Platform Modules (TPMs) or Hardware Security Modules (HSMs). This ensures only the intended application accesses the secret. In some contexts, it might be acceptable for only one participant to be authenticated."},"title":"End to End Secure Data Transmission"},"/blogs/trust_bootstrapping_secure_foundation_for_interactions/":{"data":{"":"","conclusion#Conclusion":"Trust bootstrapping is critical for creating secure digital environments. By verifying identities, managing trusted\ncredentials, and establishing robust trust relationships, we can ensure safe and reliable interactions. As cyber threats\nevolve, trust bootstrapping will remain a cornerstone of cybersecurity strategies, enabling secure communication and\ntransactions in an increasingly connected world.","disclaimer#Disclaimer":"All content provided in this article is for informational purposes only. The source of this content is public domain\ninformation as detailed in the references. The owner makes no representations regarding the accuracy or completeness of\nthe information presented. The owner will not be liable for any errors or omissions in this information or its\nvailability, nor for any losses or damages resulting from its use.","introduction#Introduction":"In today’s dynamic cybersecurity landscape, pre-establishing trust before any interaction is essential. Trust\nbootstrapping is the process that sets up a trust relationship between two or more subjects by proofing the identities\nclaimed by those subjects. The sensitivity of the data or transactions between these subjects dictates the stringency of\nthe trust establishment process.","references#References":" David Temoshok (NIST), Diana Proud-Madruga (Electrosoft), Yee-Yin Choong (NIST), Ryan Galluzzo (NIST), Sarbari Gupta (Electrosoft), Connie LaSalle (NIST), Naomi Lefkovitz (NIST), Andrew Regenscheid (NIST), “Digital Identity Guidelines”, Revision 4, 2nd Public Draft, 21 August 2024, csrc.nist.gov/pubs/sp/800/63/4/2pd T. Lodderstedt (sprind.org), D. Fett (Authlete), M. Haine (Considrd.Consulting Ltd), A. Pulido (Santander), K. Lehmann (1\u00261 Mail \u0026 Media Development \u0026 Technology GmbH), K. Koiwai (KDDI Corporation), “OpenID Connect for Identity Assurance 1.0”, 1 October 2024, openid.net/specs/openid-connect-4-identity-assurance-1_0.html ","the-analysis#The Analysis":"Trust is essential for secure interactions. Before any sensitive data exchange or transaction, trust must be established to ensure all parties can interact confidently without fear of unauthorized access or tampering.\nTrust bootstrapping involves several steps to create a secure and reliable trust relationship:\nIdentity Proofing: Collect evidence to validate and verify the trustworthiness of a subject. Digital Credential Creation: Create a digital credential, associated to the proofed identity, to facilitate future identification of the subject. Trust Relationship Formalization: Exchange public credentials to establish the trust relationship between subjects. ","the-bootstrapping-process#The Bootstrapping Process":"Trust bootstrapping, or trust establishment, is a universal concept used in well-established technologies like TLS, Key Agreement, API, as well as emerging ones such as UEFI, FIDO2, and Verifiable Credentials. For example, bootstrapping in TLS might involve adding root certificates to a trust store, while in an API authentication, it might involve storing public keys or secrets in a data repository.\nThe bootstrapping process starts with identity proofing, which involves collecting identity evidence to validate and verify it. This evidence can be any official document, physical or digital, that asserts the subject’s identity attributes. The issuer of this evidence becomes the anchor of trust, meaning the subject’s identity is as trustworthy as the issuer. Examples of such entities include governments, educational institutions, and certificate authorities. Validation checks that the evidence meets the requirements for its type, such as ensuring a passport includes all expected data and is correctly formatted. Verification ensures the subject undergoing identity proofing matches the subject described in the evidence.\nOnce the identity is verified, the next step is creating a credential that binds the verified identity with an authenticator and, generally, cryptographic material. When the bootstrapping is complete, this credential is used to exercise trust in future interactions. Successful authentications indicate the subject with the verified identity is behind the interaction.\nThe final step defines the characteristics of the relationship, including the participant subjects, the required identity assurance level, whether trust is required from both subjects or only one, etc.","the-problem#The Problem":"When two subjects initiate an interaction requiring a certain level of confidence, merely authenticating them might not\nsuffice. The true identity of the subjects becomes crucial. Are they genuinely who they claim to be?"},"title":"Trust Bootstrapping"},"/videos/":{"data":{"":"","topics#Topics":"FIDO2 - Core Concepts FIDO2 Introduction 1. A brief introduction to the series FIDO2 Elements 2. The pieces that makeup FIDO FIDO2 Registration 3. The registration flow FIDO2 Authentication 4. The authentication flow FIDO2 Authenticator Elements 5. A few characteristics of an authenticator FIDO2 Security 6. A comparison of fido2 credentials and passwords "},"title":"Videos"}}